test/testData/dummy_payment_link_collection.json

{
    "total_count": 2,
    "object": "list",
    "data": [
      {
        "id": "invc_NRFJkTGyZYo03cPD",
        "object": "payment_link",
        "amount": 100,
        "customer_id": "cust_2WmsQoSRZMWWkcZg",
        "name": "Bruce",
        "email": "a@b.com",
        "contact_no": "9999999999",
        "currency": "INR",
        "description": "Test Payment Link",
        "due_date": 0,
        "notes": null,
        "notify_by": "none",
        "customer_notification_by": "merchant",
        "payment_attempt": 0,
        "receipt_no": "Test_R123",
        "status": "issued",
        "url": "https://payabbhi.com/zpuoxajg",
        "created_at": 1556097575
      },
      {
        "id": "invc_SZ7CU0ryV9u56Kgj",
        "object": "payment_link",
        "amount": 1100,
        "customer_id": "cust_JHpnVj0s05bNOzvf",
        "name": "Wayne",
        "email": "b@c.com",
        "contact_no": "9000000000",
        "currency": "INR",
        "description": "Test Payment Link 2",
        "due_date": 0,
        "notes": null,
        "notify_by": "none",
        "customer_notification_by": "merchant",
        "payment_attempt": 0,
        "receipt_no": "Test_R122",
        "status": "issued",
        "url": "https://payabbhi.in/z5qhbg9d",
        "created_at": 1556003832,
      }
    ]
  }